online-throughput/tp-results-eagle3/bench-eagle3-c32.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9afc89d6c0>, seed=0, num_prompts=320, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='meta-llama/Llama-3.3-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=32.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-4967d01d-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 32.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     320       
Failed requests:                         0         
Maximum request concurrency:             32        
Request rate configured (RPS):           32.00     
Benchmark duration (s):                  49.81     
Total input tokens:                      56318     
Total generated tokens:                  47046     
Request throughput (req/s):              6.42      
Output token throughput (tok/s):         944.55    
Peak output token throughput (tok/s):    442.00    
Peak concurrent requests:                43.00     
Total token throughput (tok/s):          2075.26   
---------------Time to First Token----------------
Mean TTFT (ms):                          339.01    
Median TTFT (ms):                        320.78    
P99 TTFT (ms):                           697.26    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.85     
Median TPOT (ms):                        29.11     
P99 TPOT (ms):                           49.06     
---------------Inter-token Latency----------------
Mean ITL (ms):                           93.79     
Median ITL (ms):                         74.31     
P99 ITL (ms):                            216.52    
---------------Speculative Decoding---------------
Acceptance rate (%):                     54.51     
Acceptance length:                       3.18      
Drafts:                                  14798     
Draft tokens:                            59192     
Accepted tokens:                         32268     
Per-position acceptance (%):
  Position 0:                            75.10     
  Position 1:                            59.45     
  Position 2:                            46.65     
  Position 3:                            36.85     
==================================================